#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.automatic-potato-hjf-app2-bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "automatic-potato-hjf-app2"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "MULTI_REGIONAL"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 14
              + matches_storage_class = []
              + with_state            = "ANY"
            }
        }

      + versioning {
          + enabled = false
        }
    }

  # module.automatic-potato-hjf-app2-bucket.google_storage_bucket_iam_binding.binding["admins"] will be created
  + resource "google_storage_bucket_iam_binding" "binding" {
      + bucket  = "automatic-potato-hjf-app2"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:53937557592@cloudbuild.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.automatic-potato-hjf-app2-bucket.google_storage_bucket_iam_binding.binding["storage_admins"] will be created
  + resource "google_storage_bucket_iam_binding" "binding" {
      + bucket  = "automatic-potato-hjf-app2"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:devnull@broadinstitute.org",
        ]
      + role    = "roles/storage.admin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @hjfbynara, Action: `pull_request`, Working Directory: `./ap/app2/terraform`, Workflow: `App2 - Terraform PR Test`*